000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. LineNumbersHelloWorld.
000300 AUTHOR. Gregory Shields
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 PROCEDURE DIVISION.
000700
000800 PROGRAM-BEGIN.
000900     DISPLAY "Hello there, World!".                                
001000 PROGRAM-DONE.
001100     STOP RUN.
